//Да се напише програма каде од тастатура ќе се внесе датумот на раѓање во
//формат (ddmmgggg). Програмата на компјутерскиот екран ќе го испечати денот
//Структурно програмирање
//3.7. Задача 7 | 9
//и месецот на раѓање.
//Пример:
//Ако се внесе следниот број 18091992, програмата ќе испечати: 	18.09
// Искористете целобројно делење и остаток од делење.

#include <stdio.h>

int main() {

    int birthday; //ddmmgggg

    scanf("%d", &birthday);

    int x = birthday / 10000; //cut year from birthday

    printf("Day: %d / Month: %d",x / 100, x % 100);


    return 0;
}


