//Да се напише програма која чита знак од тастатура и во зависнот од тоа дали е
//мала или голема буква печати 1 или 0, соодветно.

// ако знаеме дека во ascii разликата од големата до малата буква  е 32
//тогаш можеме да ја решеме задачата по начин на којшто на вредноста во ascii
// за голема буква ќе додадеме 32..
#include <stdio.h>

int main() {
    char x;// буква којашто се внесува
 // мала печати 1 голема печати 0
    scanf("%c", &x); //
    printf("%d\n", (x >= 'a' && x <= 'z'));



    // бонус: дали е знакот цифра
    printf("it's a number if '1', not a number '0': %d", ((x >= '0') && (x <= '9')));


    return 0;
}


