//Да се напише програма која ќе чита два цели броеви (x, y) од тастура и на
//компјутерскиот екран ќе го испечати резултатот (z) од следниот израз
//        z = x++ + --y + (x<y)

#include <stdio.h>

int main() {

    int x, y, z, r;

    scanf("%d %d", &x, &y);

    z = x++ + --y + (x<y);

    //Каква вредност ќе има r за x=1, y=2, z=3?

//    r = (x<y || y<z++); //r = 1; z = 3; се исполнува првиот услов и се прекинува циклусот веднш
    // така што z нема да биде зголемено!

//    r = (x > y && y < z++);// r = 0 затоа што условот во r ќе биде неточен
    // останатото останува непроменето



//    z = x++ + --y + x<y; во оваа ситоација  лево од <y се собира
// а потоа се споредува со y



    printf("Z: %d", z);


    return 0;
}


