// Да се напише програма каде од тастатура се внесува одреден износ на пари кој корисник
// го има на својата трансакциска сметка.
// Потоа, во нов ред се внесува сумата на еден производ кој го купил,
// на кој дополнително треба да плати и ДДВ(18% од таа сума).
// Програмата печати 1 доколку после плаќањето на ДДВ корисникот има барем 1 денар на својата сметка,
// а 0 во спротивно.

#include <stdio.h>

int main() {
    float bankAccount,
          item,
          price,
          tax = 13 / 100.0;

    scanf("%f", &bankAccount);
    scanf("%f", &item);

    price = tax * item + item;

    if(bankAccount - price > 0) printf("You have '$1' left");
    else printf("Empty: $0");

    return 0;
}

