// Во една компанија сите вработени користат еден централизиран систем,
//за кој им е креирана корисничка сметка. Корисничко име(username)
//на секој вработен се добива откако од матичниот број на вработениот
// ќе се земат деловите кои го даваат датумот на раѓање и ќе се пресмета вредноста:
// ден * 100 + месец * 1000 + година
// Така ако делот од матичниот број кој го дава датумот е 1103998,
//тогаш се добива 11 * 100 + 3 * 1000 + 1998 = 6098.
// Доколку бројот кој ќе се добие по пресметката е петцифрен, тогаш тоа е корисничкото име.
// Во спротивно, доколку е четирицифрен, тогаш се додава првата цифра да биде:
// 7 - доколку годината на раѓање е до 1960
// 8 - доколку годината на раѓање е помеѓу 1961 - 1980
// 9 - доколку годината на раѓање е помеѓу 1981 - 1999
// Напомена: Се смета дека сите вработени се родени до 1999 година.
// Програмата го враќа ваквото корисничко име за внес од тастатура
// кој е дел од матичниот број на некој вработен, како во примерот.


#include <stdio.h>

int main(){
    int mID,
        username,
        counter = 0,
        month,
        day,
        year; //матичен број

    scanf("%d", &mID);

    year = mID % 1000;
    mID /= 1000;
    month = mID % 100;
    mID /= 100;
    day = mID;
    mID /= 100;

    if(mID <= 1999){
        year += 1000; //претвори ја сега во вистинска година за корисничко име
        username = day * 100 + month * 1000 + year;
        int testUsername = username;
        while (testUsername){
            counter++;
            testUsername /= 10;
        }

        if(counter < 5){  //78.593
            if(year <= 1960) username += 70000;
            else if(year <= 1980) username += 80000;
            else username += 90000;
        }

    } else printf("Error"); //барањето е сите вработени да се родени до 1999г

    printf("Username: %d", username);

    return 0;
}