// Од тастатура се внесува низа од целобројни елементи А со должина N ( N <= 100).
// Дополнително се внесува и број К. Да се трансформира низата така што на почеток
// ќе се преместат сите елементи помали од K,
// а после нив ќе следуваат броевите поголеми или еднакви на K. Редоследот на елементите да не се менува.
// Испечатете ги елементите на трансформираната низа во еден ред на
// стандарден излез разделени со празно место.
#include <stdio.h>

int main() {
    int n, k;
    scanf("%d", &n);
    int array[n];

    for (int i = 0; i < n; i++) scanf("%d", &array[i]);

    scanf("%d", &k);

    for (int i = 0; i < n; i++) {
        for(int j = i + 1; j < n; j++){
            if(array[i] > k && array[j] < k){
                int swap;
                swap = array[i];
                array[i] = array[j];
                array[j] = swap;
            }
        }
        printf("%d ", array[i]);

    }


    return 0;
}
