// Да се напише програма која за даден број К ќе дешифрира која буква во латинската азбука
// се појавува после К букви од почетната буква C. К може да биде поголемо од бројот на букви во азбуката,
// при што броењето ќе продолжи од почеток (циклично). Се земаат во предвид само големи букви.
// На влез се читаат C и К, а на излез се печати дешифрираната буква.
// Задачата да се реши користејќи низа за големите букви од латинската азбука и
// при дешифрирање да се користат стандардните операции за низи.
#include <stdio.h>
// Z == 90
// A == 65
int main() {
    char alphabet[26],
         c; //starting letter
    int k,
        x;

    scanf("%c %d", &c, &k);

    for(int i = 0; i < 26; i++){
        alphabet[i] = 'A' + i;
    }
    int initialLetter;

    for(int i = 0; i < 26; i++){
        if(alphabet[i] == c) {
            initialLetter = i;
            x = initialLetter + k;
            break;
        }
        while(x > 26){
          x-=26;
        }

        break;

    }
    printf("%c", alphabet[x]);

        return 0;
}