// Да се напише код којшто од стандарден влез ќе чита информации за една фискална сметка на следниов начин
// напрво се чита број N
// потоа ќе читаат уште N парови на вредности од следниот формат: износ тип_на_данаок
// пр. 5 100 А 50 B 66 A 77 B 88 V
// што првата вредност во парот изнесува износот на некој купен артикал,
// додека пак втората вредност е карактер (A, B, V)
// што означува каков тип на данок на додадена вредност се пресметува за тој артикал:
// А означува 18%
// B означува 5%
// V означува 0%
// Да се испечати на стандарден излез колку ќе изнесува повратокот на ДДВ за фискалната сметка
// што е вчитана од стандарден влез. Повратокот на ДДВ се пресметува како 15% од вкупно наплатеното ДДВ.

#include <stdio.h>

int main(){
    int N,
        price;
    float tax, taxTotal = 0,taxReturn;
    char taxType;

    scanf("%d", &N);

    for(int i = 0; i < N; i ++){
        scanf("%d %c", &price, &taxType);

        switch (taxType) {
            case 'A':
                tax = 18.0 / 100.0;
                break;
            case 'B':
                tax = 5.0 / 100.0;
                break;
            case 'V':
                tax = 0;
                break;
            default:
//                printf("No entry");
                break;
        }


        taxTotal += (price * tax);


    }

    taxReturn = taxTotal * 0.15;

    printf("%.2f", taxReturn);
    return 0;

}