// Од влез се внесува цел позитивен број n, така што n > 2. Со помош на ѕвездички,
// да се исцрта полн правоаголен триаголник со висина и ширина n, како во примерот:
// За n=5
//     *
//    **
//   ***
//  ****
// *****
#include <stdio.h>

int main() {
    int n;

    scanf("%d", &n);


    for(int i = 0; i < n && n > 2; i++){
        printf("\n");
        for(int j = 0; j < n; j++) {
            if(j+i == n-1 || j > n - i - 1 )printf("*");
            else printf(" ");
        }
    }

    return 0;
}

