//Да се напише програма која за дадени страни на еден разностран триаголник
//ќе ги отпечати на екран периметарот и квадратот од плоштината (нека се
//работи со a = 5, b = 7.5, c = 10.2).
#include <stdio.h>
#include <math.h> //за sqrt коренување
int main() {
    double a = 5,
          b = 7.5,
          c = 10.2,
          L,//периметар
          P, //плоштина
          s; //полупериметар

//    ми треба херенова формула за пресметка на плоштина
//    P = sqrt ( s (s - a ) (s - b) (s - c) )
//    s = полу периметар на триаголникот
//     L периметар на триагонликот и се бара со собирање на сите 3 страни

    L = a + b + c;
    s = L / 2;


    P = sqrt(s * (s - a) * (s - b) * (s - c));

    printf("L: %.2f, P: %.2f", L, P);
    return 0;
}


