// Во играта Бинго по редослед се извлекуваат непознат број броеви со вредности помеѓу 1 и 90.
// Секогаш се извлекуваат повеќе од 8 броја.
// Претпоставете дека внесувањето престанува кога ќе се внесе број кој не е во опсегот вредности.
// Освен главната добивка, играчите играат и на џокер број. Џокер бројот се формира на следниот начин:
// Се слепуваат помалку значајните цифри од првите 7 извлечени броја,
// и на тој број се додаваат сите следни внесени броеви.
// Ваша задача е да го отпечатите така добиениот џокер број.

#include <stdio.h>
int main() {

    int n, joker = 0, count = 0, digit;
    while(1){
        scanf("%d", &n);
        if(n < 1 || n > 90) break;
        if(count < 7){
            digit = n % 10;
            joker = (joker * 10) + digit; // собирај ги најмалку значајните цифри од првите 7 броеви за џокер
            count++;
        } else {
         joker += n;
        }
    }
    printf("%d", joker);
     return 0;
}