// Дефинираме вредност d за тројка цели броеви a, b и c ,
// така што таа се пресметува како сума меѓу апсолутните разлики од првиот и вториот број,
// од една страна, и вториот и третиот број, од друга страна:
// d = |(a-b)| + |(b-c)|
// Да се напише програма со којашто од тастатура се вчитуваат N тројки цели броеви
//(N се внесува од тастатура), и која што ја наоѓа и ја печати најмалата вредност за d од прочитаните тројки.

#include <stdio.h>

int main() {

    int n, d, a, b, c, x, y, minD;
    scanf("%d", &n);

    for(int i = 0; i < n; i++){
        scanf("%d %d %d", &a, &b, &c);

        x = a - b; // апсолутна вредност без библиотеки
        y = b - c;
        if(x < 0) x *= -1;
        if(y < 0) y *= -1;

        d = x + y;
        if(i == 0) minD = d;
        if(d < minD)minD = d;
    }
    printf("%d", minD);
    return 0;
}
