//Да се напише програма што од непознат број на цели броеви што се внесуваат
//од тастатура ќе го определи бројот со максимална вредност. Притоа, броевите
//        поголеми од 100 не се земаат предвид т.е. се игнорираат. Програмата завршува
//ако се внесе невалидна репрезентација на број

#include <stdio.h>
int main() {
    int n, min, max = 0;
    while (scanf("%d", &n) ){
        if (n <= 100) {
            if (max < n) {
                max = n;
            }
        }
    }
    printf("Max: %d", max);
    return 0;
}
// mora da se vnese nekoja bukva za da zavrsi programata